--- a/parte_4/comportamiento/chain_of_responsibility.md
+++ b/parte_4/comportamiento/chain_of_responsibility.md
@@ -62,34 +62,57 @@ Permitir que más de un objeto maneje una petición sin que el emisor necesite c
-### Diagrama de Clases
+### Diagramas
 
-```plantuml
-@startuml
-skinparam classAttributeIconSize 0
+**Diagrama de Clases**
 
-abstract class Handler {
-  - siguiente: Handler
-  + setSiguiente(sig: Handler)
-  + {abstract} manejar(solicitud: Solicitud)
-}
+```mermaid
+classDiagram
+    class Cliente {
+    }
+    
+    class Handler {
+        <<abstract>>
+        -siguiente: Handler
+        +setSiguiente(sig: Handler)
+        +manejar(solicitud: Solicitud)*
+    }
+    
+    class ManejadorConcretoA {
+        +manejar(solicitud: Solicitud)
+    }
+    
+    class ManejadorConcretoB {
+        +manejar(solicitud: Solicitud)
+    }
+    
+    Cliente --> Handler : envia solicitud
+    Handler o--> Handler : siguiente
+    Handler <|-- ManejadorConcretoA
+    Handler <|-- ManejadorConcretoB
+```
 
-class ManejadorConcretoA {
-  + manejar(solicitud: Solicitud)
-}
+**Diagrama de Secuencia**
 
-class ManejadorConcretoB {
-  + manejar(solicitud: Solicitud)
-}
-
-class Cliente
-
-Handler o-- Handler : siguiente
-Handler <|-- ManejadorConcretoA
-Handler <|-- ManejadorConcretoB
-Cliente -> Handler : envia solicitud
-
-@enduml
@@
 ```
 
 ## Ejemplos
